Documents/Реализация_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Реализация_ат</Name>
			<BasedOn>
				<xr:Item>Document.СчетНаОплату_ат</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипВнешнегоНомера_ат</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписанияПланируемая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифрыНомера</Name>
					<Comment>!!!rename</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КосвенныеСвязиЗаданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Задание_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ФиксацияРабот_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаНаОплату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/РегистрыСинхронизацииДокументов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>РегистрыСинхронизацииДокументов_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияСчетовНаОплату_ат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияРеализаций_ат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СинхронизированныеПечатныеФормы_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СинхронизированныеПечатныеФормы_ат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяПечатнаяФорма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РегистрыСинхронизацииДокументов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФайлаПоУмолчаниюСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТекстаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоДокументу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Реализация_ат/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВнешнийНомер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ПустаяСтрока(Данные.ВнешнийНомер) Тогда
		
		Попытка
			
			ВнешнийНомерКакЧисло = Число(Данные.ВнешнийНомер);
			Если ВнешнийНомерКакЧисло = 0 Тогда
				
				Если ПустаяСтрока(Данные.Номер) Тогда
					ВнешнийНомер = "новая";
				Иначе
					ВнешнийНомер = Формат(Число(Данные.Номер), "ЧГ=");
				КонецЕсли;
				
			Иначе
				ВнешнийНомер = Данные.ВнешнийНомер;
			КонецЕсли;
			
		Исключение
			ВнешнийНомер = Данные.ВнешнийНомер;
		КонецПопытки;
		
	Иначе
		
		Если ПустаяСтрока(Данные.Номер) Тогда
			ВнешнийНомер = "новая";
		Иначе
			ВнешнийНомер = Формат(Число(Данные.Номер), "ЧГ=");
		КонецЕсли;
		
	КонецЕсли;
	
	Представление = "Реализация " + ВнешнийНомер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yy");
	
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СинхронизированныеПечатныеФормы_ат.РегистрСинхронизации,
		|	СинхронизированныеПечатныеФормы_ат.ИмяМакета,
		|	СинхронизированныеПечатныеФормы_ат.Наименование,
		|	СинхронизированныеПечатныеФормы_ат.ВнешняяПечатнаяФорма,
		|	СинхронизированныеПечатныеФормы_ат.Порядок,
		|	СинхронизированныеПечатныеФормы_ат.ТипФайлаПоУмолчаниюСтрокой,
		|	СинхронизированныеПечатныеФормы_ат.ИспользоватьДляОтправки,
		|	СинхронизированныеПечатныеФормы_ат.ШаблонТекстаПисьма
		|ИЗ
		|	Справочник.СинхронизированныеПечатныеФормы_ат КАК СинхронизированныеПечатныеФормы_ат
		|ГДЕ
		|	НЕ СинхронизированныеПечатныеФормы_ат.ПометкаУдаления
		|	И СинхронизированныеПечатныеФормы_ат.РегистрСинхронизации = &РегистрСинхронизации";
	
	Запрос.УстановитьПараметр("РегистрСинхронизации", Перечисления.РегистрыСинхронизацииДокументов_ат.СинхронизацияРеализаций_ат);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = Выборка.ИмяМакета;
		КомандаПечати.Представление = Выборка.Наименование;
		КомандаПечати.СписокФорм	= "ФормаСпискаИВыбора,ФормаДокумента";
		КомандаПечати.Порядок		= Выборка.Порядок;
		
		Если НЕ ПустаяСтрока(Выборка.ТипФайлаПоУмолчаниюСтрокой) Тогда
			КомандаПечати.ФорматСохранения = ТипФайлаТабличногоДокумента[Выборка.ТипФайлаПоУмолчаниюСтрокой];
		КонецЕсли;
		
		КомандаПечати.ДополнительныеПараметры.Вставить("РегистрСинхронизации",		Выборка.РегистрСинхронизации);
		КомандаПечати.ДополнительныеПараметры.Вставить("ВнешняяПечатнаяФорма",		Выборка.ВнешняяПечатнаяФорма);
		КомандаПечати.ДополнительныеПараметры.Вставить("ИспользоватьДляОтправки",	Выборка.ИспользоватьДляОтправки);
		
		Если НЕ ПустаяСтрока(Выборка.ШаблонТекстаПисьма) Тогда
			КомандаПечати.ДополнительныеПараметры.Вставить("ШаблонТекстаПисьма",	Выборка.ШаблонТекстаПисьма);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт //!!!TODO: сделать одну процедуру для счетов и актов
	
	Финансы_ат.ПечатьФинДокумента(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

Функция   ПолучитьПланируемуюДатуПодписания(Дата, Договор) Экспорт
	
	СрокПодписанияВДнях = ?(Договор.Родитель.Пустая(), Договор.СрокПодписанияРеализации, Договор.Родитель.СрокПодписанияРеализации); 
	
	Если СрокПодписанияВДнях = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат ПродолжительностьПроцессов_Сервер_ат.ПолучитьДату(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()), СрокПодписанияВДнях);
		
	КонецЕсли;
	
КонецФункции

Процедура ЗаменитьПараметрыВТекстеПисьма(Реализация, Текст, КоличествоОтправляемых = 1, РазныеДоговоры = Ложь, ОдинаковыйПериод = Истина) Экспорт
	
	Параметр = "&Реализация";
	Если СтрНайти(Текст, Параметр) > 0 Тогда
		
		Текст = СтрЗаменить(Текст, Параметр, ?(КоличествоОтправляемых > 1, "Реализации", "Реализация"));
		
	КонецЕсли;
	
	Уведомления_ат.ЗаменитьПараметрыВТекстеПисьмаФинансовогоДокумента(Реализация, Текст, КоличествоОтправляемых, РазныеДоговоры, ОдинаковыйПериод);
	
КонецПроцедуры

Функция   ПолучитьТемуПисьма(Документ, КоличествоОбъектов, ПредставлениеПериода = "") Экспорт
	
	Возврат Уведомления_ат.ПолучитьТемуПисьмаДляОтправкиДокумента(Документ, "Реализации", КоличествоОбъектов, ПредставлениеПериода);
	
КонецФункции
